Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 120, 48, 64, 64)   4864      
_________________________________________________________________
leaky_re_lu_3 (LeakyReLU)    (None, 120, 48, 64, 64)   0         
_________________________________________________________________
dropout (Dropout)            (None, 120, 48, 64, 64)   0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 120, 24, 32, 128)  204928    
_________________________________________________________________
leaky_re_lu_4 (LeakyReLU)    (None, 120, 24, 32, 128)  0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 120, 24, 32, 128)  0         
_________________________________________________________________
flatten (Flatten)            (None, 11796480)          0         
_________________________________________________________________
dense_1 (Dense)              (None, 1)                 11796481  
=================================================================
Total params: 12,006,273
Trainable params: 12,006,273
Non-trainable params: 0
_________________________________________________________________
