Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense (Dense)                (None, 737280)            73728000  
_________________________________________________________________
batch_normalization (BatchNo (None, 737280)            2949120   
_________________________________________________________________
leaky_re_lu (LeakyReLU)      (None, 737280)            0         
_________________________________________________________________
reshape (Reshape)            (None, 15, 12, 16, 256)   0         
_________________________________________________________________
conv3d_transpose (Conv3DTran (None, 30, 24, 32, 128)   4096000   
_________________________________________________________________
batch_normalization_1 (Batch (None, 30, 24, 32, 128)   512       
_________________________________________________________________
leaky_re_lu_1 (LeakyReLU)    (None, 30, 24, 32, 128)   0         
_________________________________________________________________
conv3d_transpose_1 (Conv3DTr (None, 60, 48, 64, 64)    1024000   
_________________________________________________________________
batch_normalization_2 (Batch (None, 60, 48, 64, 64)    256       
_________________________________________________________________
leaky_re_lu_2 (LeakyReLU)    (None, 60, 48, 64, 64)    0         
_________________________________________________________________
conv3d_transpose_2 (Conv3DTr (None, 120, 96, 128, 3)   24000     
=================================================================
Total params: 81,821,888
Trainable params: 80,346,944
Non-trainable params: 1,474,944
_________________________________________________________________
