Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 40, 12, 16, 128)   6272      
_________________________________________________________________
leaky_re_lu_4 (LeakyReLU)    (None, 40, 12, 16, 128)   0         
_________________________________________________________________
dropout (Dropout)            (None, 40, 12, 16, 128)   0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 40, 6, 8, 256)     524544    
_________________________________________________________________
leaky_re_lu_5 (LeakyReLU)    (None, 40, 6, 8, 256)     0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 40, 6, 8, 256)     0         
_________________________________________________________________
flatten (Flatten)            (None, 491520)            0         
_________________________________________________________________
dense_1 (Dense)              (None, 1)                 491521    
=================================================================
Total params: 1,022,337
Trainable params: 1,022,337
Non-trainable params: 0
_________________________________________________________________
