Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense (Dense)                (None, 15360)             1536000   
_________________________________________________________________
batch_normalization (BatchNo (None, 15360)             61440     
_________________________________________________________________
leaky_re_lu (LeakyReLU)      (None, 15360)             0         
_________________________________________________________________
reshape (Reshape)            (None, 5, 3, 4, 256)      0         
_________________________________________________________________
conv3d_transpose (Conv3DTran (None, 5, 3, 4, 256)      8192000   
_________________________________________________________________
batch_normalization_1 (Batch (None, 5, 3, 4, 256)      1024      
_________________________________________________________________
leaky_re_lu_1 (LeakyReLU)    (None, 5, 3, 4, 256)      0         
_________________________________________________________________
conv3d_transpose_1 (Conv3DTr (None, 10, 6, 8, 128)     4096000   
_________________________________________________________________
batch_normalization_2 (Batch (None, 10, 6, 8, 128)     512       
_________________________________________________________________
leaky_re_lu_2 (LeakyReLU)    (None, 10, 6, 8, 128)     0         
_________________________________________________________________
conv3d_transpose_2 (Conv3DTr (None, 20, 12, 16, 128)   2048000   
_________________________________________________________________
batch_normalization_3 (Batch (None, 20, 12, 16, 128)   512       
_________________________________________________________________
leaky_re_lu_3 (LeakyReLU)    (None, 20, 12, 16, 128)   0         
_________________________________________________________________
conv3d_transpose_3 (Conv3DTr (None, 40, 24, 32, 3)     48000     
=================================================================
Total params: 15,983,488
Trainable params: 15,951,744
Non-trainable params: 31,744
_________________________________________________________________
