Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv3d (Conv3D)              (None, 40, 48, 64, 128)   48128     
_________________________________________________________________
leaky_re_lu_4 (LeakyReLU)    (None, 40, 48, 64, 128)   0         
_________________________________________________________________
dropout (Dropout)            (None, 40, 48, 64, 128)   0         
_________________________________________________________________
conv3d_1 (Conv3D)            (None, 20, 24, 32, 256)   4096256   
_________________________________________________________________
leaky_re_lu_5 (LeakyReLU)    (None, 20, 24, 32, 256)   0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 20, 24, 32, 256)   0         
_________________________________________________________________
flatten (Flatten)            (None, 3932160)           0         
_________________________________________________________________
dense_1 (Dense)              (None, 1)                 3932161   
=================================================================
Total params: 8,076,545
Trainable params: 8,076,545
Non-trainable params: 0
_________________________________________________________________
