Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense (Dense)                (None, 61440)             6144000   
_________________________________________________________________
batch_normalization (BatchNo (None, 61440)             245760    
_________________________________________________________________
leaky_re_lu (LeakyReLU)      (None, 61440)             0         
_________________________________________________________________
reshape (Reshape)            (None, 5, 6, 8, 256)      0         
_________________________________________________________________
conv3d_transpose (Conv3DTran (None, 10, 12, 16, 128)   4096000   
_________________________________________________________________
batch_normalization_1 (Batch (None, 10, 12, 16, 128)   512       
_________________________________________________________________
leaky_re_lu_1 (LeakyReLU)    (None, 10, 12, 16, 128)   0         
_________________________________________________________________
conv3d_transpose_1 (Conv3DTr (None, 20, 24, 32, 64)    1024000   
_________________________________________________________________
batch_normalization_2 (Batch (None, 20, 24, 32, 64)    256       
_________________________________________________________________
leaky_re_lu_2 (LeakyReLU)    (None, 20, 24, 32, 64)    0         
_________________________________________________________________
conv3d_transpose_2 (Conv3DTr (None, 40, 48, 64, 32)    256000    
_________________________________________________________________
batch_normalization_3 (Batch (None, 40, 48, 64, 32)    128       
_________________________________________________________________
leaky_re_lu_3 (LeakyReLU)    (None, 40, 48, 64, 32)    0         
_________________________________________________________________
conv3d_transpose_3 (Conv3DTr (None, 80, 96, 128, 3)    12000     
=================================================================
Total params: 11,778,656
Trainable params: 11,655,328
Non-trainable params: 123,328
_________________________________________________________________
