Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 60, 18, 24, 128)   6272      
_________________________________________________________________
leaky_re_lu_4 (LeakyReLU)    (None, 60, 18, 24, 128)   0         
_________________________________________________________________
dropout (Dropout)            (None, 60, 18, 24, 128)   0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 60, 9, 12, 256)    524544    
_________________________________________________________________
leaky_re_lu_5 (LeakyReLU)    (None, 60, 9, 12, 256)    0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 60, 9, 12, 256)    0         
_________________________________________________________________
flatten (Flatten)            (None, 1658880)           0         
_________________________________________________________________
dense_1 (Dense)              (None, 1)                 1658881   
=================================================================
Total params: 2,189,697
Trainable params: 2,189,697
Non-trainable params: 0
_________________________________________________________________
