Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 40, 96, 128, 64)   4864      
_________________________________________________________________
leaky_re_lu_4 (LeakyReLU)    (None, 40, 96, 128, 64)   0         
_________________________________________________________________
dropout (Dropout)            (None, 40, 96, 128, 64)   0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 40, 48, 64, 128)   204928    
_________________________________________________________________
leaky_re_lu_5 (LeakyReLU)    (None, 40, 48, 64, 128)   0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 40, 48, 64, 128)   0         
_________________________________________________________________
flatten (Flatten)            (None, 15728640)          0         
_________________________________________________________________
dense_1 (Dense)              (None, 1)                 15728641  
=================================================================
Total params: 15,938,433
Trainable params: 15,938,433
Non-trainable params: 0
_________________________________________________________________
