Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense (Dense)                (None, 245760)            24576000  
_________________________________________________________________
batch_normalization (BatchNo (None, 245760)            983040    
_________________________________________________________________
leaky_re_lu (LeakyReLU)      (None, 245760)            0         
_________________________________________________________________
reshape (Reshape)            (None, 5, 12, 16, 256)    0         
_________________________________________________________________
conv3d_transpose (Conv3DTran (None, 10, 24, 32, 128)   4096000   
_________________________________________________________________
batch_normalization_1 (Batch (None, 10, 24, 32, 128)   512       
_________________________________________________________________
leaky_re_lu_1 (LeakyReLU)    (None, 10, 24, 32, 128)   0         
_________________________________________________________________
conv3d_transpose_1 (Conv3DTr (None, 20, 48, 64, 64)    1024000   
_________________________________________________________________
batch_normalization_2 (Batch (None, 20, 48, 64, 64)    256       
_________________________________________________________________
leaky_re_lu_2 (LeakyReLU)    (None, 20, 48, 64, 64)    0         
_________________________________________________________________
conv3d_transpose_2 (Conv3DTr (None, 40, 96, 128, 64)   512000    
_________________________________________________________________
batch_normalization_3 (Batch (None, 40, 96, 128, 64)   256       
_________________________________________________________________
leaky_re_lu_3 (LeakyReLU)    (None, 40, 96, 128, 64)   0         
_________________________________________________________________
conv3d_transpose_3 (Conv3DTr (None, 40, 192, 256, 3)   24000     
=================================================================
Total params: 31,216,064
Trainable params: 30,724,032
Non-trainable params: 492,032
_________________________________________________________________
