Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 60, 180, 240, 16)  784       
_________________________________________________________________
leaky_re_lu_3 (LeakyReLU)    (None, 60, 180, 240, 16)  0         
_________________________________________________________________
dropout (Dropout)            (None, 60, 180, 240, 16)  0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 60, 90, 120, 64)   16448     
_________________________________________________________________
leaky_re_lu_4 (LeakyReLU)    (None, 60, 90, 120, 64)   0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 60, 90, 120, 64)   0         
_________________________________________________________________
flatten (Flatten)            (None, 41472000)          0         
_________________________________________________________________
dense_1 (Dense)              (None, 1)                 41472001  
=================================================================
Total params: 41,489,233
Trainable params: 41,489,233
Non-trainable params: 0
_________________________________________________________________
