Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense (Dense)                (None, 4608)              460800    
_________________________________________________________________
batch_normalization (BatchNo (None, 4608)              18432     
_________________________________________________________________
leaky_re_lu (LeakyReLU)      (None, 4608)              0         
_________________________________________________________________
reshape (Reshape)            (None, 1, 6, 8, 96)       0         
_________________________________________________________________
conv3d_transpose (Conv3DTran (None, 5, 30, 40, 96)     1152000   
_________________________________________________________________
batch_normalization_1 (Batch (None, 5, 30, 40, 96)     384       
_________________________________________________________________
leaky_re_lu_1 (LeakyReLU)    (None, 5, 30, 40, 96)     0         
_________________________________________________________________
conv3d_transpose_1 (Conv3DTr (None, 15, 90, 120, 48)   576000    
_________________________________________________________________
batch_normalization_2 (Batch (None, 15, 90, 120, 48)   192       
_________________________________________________________________
leaky_re_lu_2 (LeakyReLU)    (None, 15, 90, 120, 48)   0         
_________________________________________________________________
conv3d_transpose_2 (Conv3DTr (None, 60, 360, 480, 3)   18000     
=================================================================
Total params: 2,225,808
Trainable params: 2,216,304
Non-trainable params: 9,504
_________________________________________________________________
