Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 40, 96, 128, 128)  6272      
_________________________________________________________________
leaky_re_lu_4 (LeakyReLU)    (None, 40, 96, 128, 128)  0         
_________________________________________________________________
dropout (Dropout)            (None, 40, 96, 128, 128)  0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 40, 48, 64, 256)   524544    
_________________________________________________________________
leaky_re_lu_5 (LeakyReLU)    (None, 40, 48, 64, 256)   0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 40, 48, 64, 256)   0         
_________________________________________________________________
flatten (Flatten)            (None, 31457280)          0         
_________________________________________________________________
dense_1 (Dense)              (None, 1)                 31457281  
=================================================================
Total params: 31,988,097
Trainable params: 31,988,097
Non-trainable params: 0
_________________________________________________________________
