Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense (Dense)                (None, 983040)            98304000  
_________________________________________________________________
batch_normalization (BatchNo (None, 983040)            3932160   
_________________________________________________________________
leaky_re_lu (LeakyReLU)      (None, 983040)            0         
_________________________________________________________________
reshape (Reshape)            (None, 5, 24, 32, 256)    0         
_________________________________________________________________
conv3d_transpose (Conv3DTran (None, 5, 24, 32, 256)    8192000   
_________________________________________________________________
batch_normalization_1 (Batch (None, 5, 24, 32, 256)    1024      
_________________________________________________________________
leaky_re_lu_1 (LeakyReLU)    (None, 5, 24, 32, 256)    0         
_________________________________________________________________
conv3d_transpose_1 (Conv3DTr (None, 10, 48, 64, 128)   4096000   
_________________________________________________________________
batch_normalization_2 (Batch (None, 10, 48, 64, 128)   512       
_________________________________________________________________
leaky_re_lu_2 (LeakyReLU)    (None, 10, 48, 64, 128)   0         
_________________________________________________________________
conv3d_transpose_2 (Conv3DTr (None, 20, 96, 128, 128)  2048000   
_________________________________________________________________
batch_normalization_3 (Batch (None, 20, 96, 128, 128)  512       
_________________________________________________________________
leaky_re_lu_3 (LeakyReLU)    (None, 20, 96, 128, 128)  0         
_________________________________________________________________
conv3d_transpose_3 (Conv3DTr (None, 40, 192, 256, 3)   48000     
=================================================================
Total params: 116,622,208
Trainable params: 114,655,104
Non-trainable params: 1,967,104
_________________________________________________________________
