Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 40, 40, 90, 64)    4864      
_________________________________________________________________
leaky_re_lu_3 (LeakyReLU)    (None, 40, 40, 90, 64)    0         
_________________________________________________________________
dropout (Dropout)            (None, 40, 40, 90, 64)    0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 40, 20, 45, 128)   204928    
_________________________________________________________________
leaky_re_lu_4 (LeakyReLU)    (None, 40, 20, 45, 128)   0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 40, 20, 45, 128)   0         
_________________________________________________________________
flatten (Flatten)            (None, 4608000)           0         
_________________________________________________________________
dense_1 (Dense)              (None, 1)                 4608001   
=================================================================
Total params: 4,817,793
Trainable params: 4,817,793
Non-trainable params: 0
_________________________________________________________________
