Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense (Dense)                (None, 1152)              115200    
_________________________________________________________________
batch_normalization (BatchNo (None, 1152)              4608      
_________________________________________________________________
leaky_re_lu (LeakyReLU)      (None, 1152)              0         
_________________________________________________________________
reshape (Reshape)            (None, 1, 3, 4, 96)       0         
_________________________________________________________________
conv3d_transpose (Conv3DTran (None, 5, 15, 20, 96)     1152000   
_________________________________________________________________
batch_normalization_1 (Batch (None, 5, 15, 20, 96)     384       
_________________________________________________________________
leaky_re_lu_1 (LeakyReLU)    (None, 5, 15, 20, 96)     0         
_________________________________________________________________
conv3d_transpose_1 (Conv3DTr (None, 10, 45, 60, 48)    576000    
_________________________________________________________________
batch_normalization_2 (Batch (None, 10, 45, 60, 48)    192       
_________________________________________________________________
leaky_re_lu_2 (LeakyReLU)    (None, 10, 45, 60, 48)    0         
_________________________________________________________________
conv3d_transpose_2 (Conv3DTr (None, 20, 180, 240, 16)  96000     
_________________________________________________________________
batch_normalization_3 (Batch (None, 20, 180, 240, 16)  64        
_________________________________________________________________
leaky_re_lu_3 (LeakyReLU)    (None, 20, 180, 240, 16)  0         
_________________________________________________________________
conv3d_transpose_3 (Conv3DTr (None, 40, 360, 480, 3)   6000      
=================================================================
Total params: 1,950,448
Trainable params: 1,947,824
Non-trainable params: 2,624
_________________________________________________________________
