Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense (Dense)                (None, 9216)              921600    
_________________________________________________________________
batch_normalization (BatchNo (None, 9216)              36864     
_________________________________________________________________
leaky_re_lu (LeakyReLU)      (None, 9216)              0         
_________________________________________________________________
reshape (Reshape)            (None, 2, 6, 8, 96)       0         
_________________________________________________________________
conv3d_transpose (Conv3DTran (None, 10, 30, 40, 96)    1152000   
_________________________________________________________________
batch_normalization_1 (Batch (None, 10, 30, 40, 96)    384       
_________________________________________________________________
leaky_re_lu_1 (LeakyReLU)    (None, 10, 30, 40, 96)    0         
_________________________________________________________________
conv3d_transpose_1 (Conv3DTr (None, 20, 90, 120, 48)   576000    
_________________________________________________________________
batch_normalization_2 (Batch (None, 20, 90, 120, 48)   192       
_________________________________________________________________
leaky_re_lu_2 (LeakyReLU)    (None, 20, 90, 120, 48)   0         
_________________________________________________________________
conv3d_transpose_2 (Conv3DTr (None, 40, 360, 480, 3)   18000     
=================================================================
Total params: 2,705,040
Trainable params: 2,686,320
Non-trainable params: 18,720
_________________________________________________________________
