Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense (Dense)                (None, 2304000)           230400000 
_________________________________________________________________
batch_normalization (BatchNo (None, 2304000)           9216000   
_________________________________________________________________
leaky_re_lu (LeakyReLU)      (None, 2304000)           0         
_________________________________________________________________
reshape (Reshape)            (None, 10, 20, 45, 256)   0         
_________________________________________________________________
conv3d_transpose (Conv3DTran (None, 10, 20, 45, 128)   4096000   
_________________________________________________________________
batch_normalization_1 (Batch (None, 10, 20, 45, 128)   512       
_________________________________________________________________
leaky_re_lu_1 (LeakyReLU)    (None, 10, 20, 45, 128)   0         
_________________________________________________________________
conv3d_transpose_1 (Conv3DTr (None, 20, 40, 90, 64)    1024000   
_________________________________________________________________
batch_normalization_2 (Batch (None, 20, 40, 90, 64)    256       
_________________________________________________________________
leaky_re_lu_2 (LeakyReLU)    (None, 20, 40, 90, 64)    0         
_________________________________________________________________
conv3d_transpose_2 (Conv3DTr (None, 40, 80, 180, 3)    24000     
=================================================================
Total params: 244,760,768
Trainable params: 240,152,384
Non-trainable params: 4,608,384
_________________________________________________________________
