Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense (Dense)                (None, 30720)             3072000   
_________________________________________________________________
batch_normalization (BatchNo (None, 30720)             122880    
_________________________________________________________________
leaky_re_lu (LeakyReLU)      (None, 30720)             0         
_________________________________________________________________
reshape (Reshape)            (None, 5, 3, 4, 512)      0         
_________________________________________________________________
conv3d_transpose (Conv3DTran (None, 10, 6, 8, 256)     16384000  
_________________________________________________________________
batch_normalization_1 (Batch (None, 10, 6, 8, 256)     1024      
_________________________________________________________________
leaky_re_lu_1 (LeakyReLU)    (None, 10, 6, 8, 256)     0         
_________________________________________________________________
conv3d_transpose_1 (Conv3DTr (None, 20, 12, 16, 128)   4096000   
_________________________________________________________________
batch_normalization_2 (Batch (None, 20, 12, 16, 128)   512       
_________________________________________________________________
leaky_re_lu_2 (LeakyReLU)    (None, 20, 12, 16, 128)   0         
_________________________________________________________________
conv3d_transpose_2 (Conv3DTr (None, 60, 36, 48, 3)     48000     
=================================================================
Total params: 23,724,416
Trainable params: 23,662,208
Non-trainable params: 62,208
_________________________________________________________________
